from gmpy2 import iroot
import itertools
pkey = (150953688, 373824666550208932851344358703053061405262438259996622188837935528607451817812480600479188884096072016823491996056842120586016323642383543231913508464973502962030059403443181467594283936168384790367731793997013711256520780338341018619858240958105689126133812557401122953030695509876185592917323138313818881164334490044163316692588337720342646339764174333821950301279825316497898035760524780198230860089280791887363472060435443944632303774987556026740232641561706904946900169858650106994947597642013168757868017723456208796677559254390940651802333382820063200360490892131573853635471525711894510477078934343423255983)
enc = 275574424285842306309073814038154403551700455145115884031072340378743712325975683329051874910297915882286569143815715537085387363420246497061870251520240399514896001311724695996978111559476733709139080970977190150345474341853495386364275702356438666152069791355990718058189043717952080875207858163490627801836274404446661613239167700736337269924479349700031535265765885064606399858172168036794462235707003475360358004643720927563261787867952228496769300443415094124132722170498229611285689671203272698693505808912907778910378274197503048226322090611405601517624884408718689404556983397217070272851442351897456769883
e,n = pkey
s = 14071
r = 2^3 * 3^2 * 149 # 10728

a1a2 = 4397106541348746609449022494306645596976095328661052362645396531878498968338952548826818779279481410282994277724667976630941256002507738149052238886643876
t1_t2 = n-e-a1a2**4
t1t2=e*a1a2**4

var('x')

S = t1_t2
P = t1t2

# 构造二次方程
f = x^2 - S*x + P

# 求根
roots = solve(f == 0, x)

for s in range(1,2**14,2):
    if(iroot(t1//s,4)[1]):
        a1 = iroot(t1//s,4)[0]
        r = e // s
        a2 = iroot(t2//r,4)[0]

        break
p=a1**4+r
q=a2**4+s
L=(p-1)*(q-1)
print(e)
g = gcd(e,q-1)
print(g)

def get_oneroot(p, e):
    while True:
        Zp = Zmod(p)                     # 在模 p 的有限域上
        g = Zp.random_element()          # 随机取一个元素
        g = g^((p-1) // e)               # 提升为 e 次单位根：g^e = 1

        # 检查是否是“本原 e 次单位根”（阶正好是 e）
        for mult in divisors(e):         
            if (mult != e):              # 检查所有真因子
                g2 = g^mult
                if (g2 == 1):            # 如果存在更小幂等于1，说明阶不够
                    break
        else:
            return g                     # 找到阶正好为 e 的元素

def decrypt(p, c, e):
    w = gcd(e, p-1)                     # w = gcd(e, p-1)，决定解的个数
    e1, p1 = e // w, (p-1) // w         # 把 e 和 p-1 分解
    d = inverse_mod(e1, p1)             # 求 e1 在模 p1 下的逆元
    c1 = pow(c, d, p)                   # 相当于“降幂”，得到一个中间值
    g, a, b = xgcd(p1, w)               # 扩展欧几里得：a*p1 + b*w = 1
    g = get_oneroot(p, w)               # 找一个 w 次单位根（生成所有解用）
    m = pow(c1, b, p)                   # 构造一个特解 m
    # 所有解 = m * g^i（i = 0...w-1）
    return [ZZ(m * g^i) for i in range(w)]


# 在模 p 下求所有解
mp_list = decrypt(p, enc, e)
print('Find root p OK')

# 在模 q 下求所有解
mq_list = decrypt(q, enc, e)
print('Find root q OK')

# 枚举所有组合（笛卡尔积）
for mp, mq in itertools.product(mp_list, mq_list):
    m = crt([mp, mq], [p, q])          # 中国剩余定理合并成 mod n 的解
    msg = long_to_bytes(int(m))        
    if (b'CCTF' in msg):              
        print(msg)

'''
#!/usr/bin/env python3

from Crypto.Util.number import *
from secret import m, flag

def genPrime(m, nbit):
	assert m >= 2
	while True:
		a = getRandomNBitInteger(nbit // m)
		r = getRandomNBitInteger(m ** 2 - m + 2)
		p = a ** m + r
		if isPrime(p):
			return (p, r)

def genkey(m, nbit):
	p, r = genPrime(m, nbit // 2)
	q, s = genPrime(m, nbit // 2)
	n = p * q
	e = r * s
	return (e, n)

def encrypt(msg, pkey):
	e, n = pkey
	m = bytes_to_long(msg)
	c = pow(m, e, n)
	return c

pkey = genkey(m, 2048)
enc = encrypt(flag, pkey)

print(f'pkey = {pkey}')
print(f'enc = {enc}')
'''